#Напишите программу, которая определит ,
# присутствует ли в данном списке строк заданное число

array = ['12', '222', '90' , '55']
print(array)
num = input()

if num in array:
    print('Yes')
else:
    print('No')
    