# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.
a = input('Введите словож: ')
b = input('Что нужно посчитать: ')
print(a.count(b))