# 2. Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N в виде списка.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]



# num_list = []
# n = int (input ('Введите длину списка '))
# for k in range (1, n+1):
#     num_list.append (k * 1 + 1 )
# print (num_list)


N = int(input())
sum = 1
f = 1
for g in range(1, N + 1):
    f = f / g
    sum += f
print(sum)